quickstarts/demos/policy-security-saml/src/test/resources/xml/soap-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:policy-security-saml="urn:switchyard-quickstart-demo:policy-security-saml:0.1.0">
    <soap:Header>
        <wsse:Security>
            <!-- Assertion -->
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <policy-security-saml:doWork>
            <work>
                <command>WORK_CMD</command>
            </work>
        </policy-security-saml:doWork>
    </soap:Body>
</soap:Envelope>
